results/pagination/run-2/pagination-cursor-2500.log
COMMAND: make pagination TYPE=cursor CURSOR_DEPTH_PAGES=2500 LIMIT=20

==== OUTPUT ====

k6 run \
	-e BASE_URL=http://3.39.39.25:3000/v1 \
	-e TYPE=cursor \
	-e LIMIT=20 \
	-e OFFSET= \
	-e CURSOR_DEPTH_PAGES=2500 \
	loadtest/pagination.js

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: loadtest/pagination.js
        output: -

     scenarios: (100.00%) 1 scenario, 300 max VUs, 1m30s max duration (incl. graceful stop):
              * pagination_load: 100.00 iterations/s for 1m0s (maxVUs: 100-300, gracefulStop: 30s)


Run               [ 100% ] setup()
pagination_load   [   0% ]

Run               [ 100% ] setup()
pagination_load   [   0% ]

Run               [ 100% ] setup()
pagination_load   [   0% ]

Run               [ 100% ] setup()
pagination_load   [   0% ]

Run               [ 100% ] setup()
pagination_load   [   0% ]

Run               [ 100% ] setup()
pagination_load   [   0% ]

Run               [ 100% ] setup()
pagination_load   [   0% ]

Run               [ 100% ] setup()
pagination_load   [   0% ]

Run               [ 100% ] setup()
pagination_load   [   0% ]

Run               [ 100% ] setup()
pagination_load   [   0% ]

Run               [ 100% ] setup()
pagination_load   [   0% ]

running (0m12.0s), 001/100 VUs, 43 complete and 0 interrupted iterations
pagination_load   [   1% ] 001/100 VUs  0m00.4s/1m0s  100.00 iters/s

running (0m13.0s), 001/100 VUs, 143 complete and 0 interrupted iterations
pagination_load   [   2% ] 001/100 VUs  0m01.4s/1m0s  100.00 iters/s

running (0m14.0s), 001/100 VUs, 243 complete and 0 interrupted iterations
pagination_load   [   4% ] 001/100 VUs  0m02.4s/1m0s  100.00 iters/s

running (0m15.0s), 001/100 VUs, 343 complete and 0 interrupted iterations
pagination_load   [   6% ] 001/100 VUs  0m03.4s/1m0s  100.00 iters/s

running (0m15.1s), 000/100 VUs, 352 complete and 0 interrupted iterations
pagination_load   [   6% ] 000/100 VUs  0m03.5s/1m0s  100.00 iters/s

running (0m15.1s), 000/100 VUs, 354 complete and 0 interrupted iterations
pagination_load   [   6% ] 000/100 VUs  0m03.5s/1m0s  100.00 iters/s

running (0m15.1s), 001/100 VUs, 355 complete and 0 interrupted iterations
pagination_load   [   6% ] 001/100 VUs  0m03.6s/1m0s  100.00 iters/s

running (0m15.1s), 000/100 VUs, 357 complete and 0 interrupted iterations
pagination_load   [   6% ] 000/100 VUs  0m03.6s/1m0s  100.00 iters/s

running (0m15.1s), 000/100 VUs, 359 complete and 0 interrupted iterations
pagination_load   [   6% ] 000/100 VUs  0m03.6s/1m0s  100.00 iters/s

running (0m15.1s), 000/100 VUs, 360 complete and 0 interrupted iterations
pagination_load   [   6% ] 000/100 VUs  0m03.6s/1m0s  100.00 iters/s

running (0m15.2s), 000/100 VUs, 362 complete and 0 interrupted iterations
pagination_load   [   6% ] 000/100 VUs  0m03.6s/1m0s  100.00 iters/s

running (0m15.2s), 001/100 VUs, 363 complete and 0 interrupted iterations
pagination_load   [   6% ] 001/100 VUs  0m03.6s/1m0s  100.00 iters/s

running (0m15.2s), 000/100 VUs, 367 complete and 0 interrupted iterations
pagination_load   [   6% ] 000/100 VUs  0m03.7s/1m0s  100.00 iters/s

running (0m16.0s), 001/100 VUs, 443 complete and 0 interrupted iterations
pagination_load   [   7% ] 001/100 VUs  0m04.4s/1m0s  100.00 iters/s

running (0m17.0s), 001/100 VUs, 543 complete and 0 interrupted iterations
pagination_load   [   9% ] 001/100 VUs  0m05.4s/1m0s  100.00 iters/s

running (0m18.0s), 001/100 VUs, 643 complete and 0 interrupted iterations
pagination_load   [  11% ] 001/100 VUs  0m06.4s/1m0s  100.00 iters/s

running (0m19.0s), 001/100 VUs, 743 complete and 0 interrupted iterations
pagination_load   [  12% ] 001/100 VUs  0m07.4s/1m0s  100.00 iters/s

running (0m20.0s), 001/100 VUs, 843 complete and 0 interrupted iterations
pagination_load   [  14% ] 001/100 VUs  0m08.4s/1m0s  100.00 iters/s

running (0m21.0s), 001/100 VUs, 943 complete and 0 interrupted iterations
pagination_load   [  16% ] 001/100 VUs  0m09.4s/1m0s  100.00 iters/s

running (0m22.0s), 001/100 VUs, 1043 complete and 0 interrupted iterations
pagination_load   [  17% ] 001/100 VUs  0m10.4s/1m0s  100.00 iters/s

running (0m23.0s), 001/100 VUs, 1143 complete and 0 interrupted iterations
pagination_load   [  19% ] 001/100 VUs  0m11.4s/1m0s  100.00 iters/s

running (0m24.0s), 001/100 VUs, 1243 complete and 0 interrupted iterations
pagination_load   [  21% ] 001/100 VUs  0m12.4s/1m0s  100.00 iters/s

running (0m25.0s), 001/100 VUs, 1343 complete and 0 interrupted iterations
pagination_load   [  22% ] 001/100 VUs  0m13.4s/1m0s  100.00 iters/s

running (0m26.0s), 001/100 VUs, 1443 complete and 0 interrupted iterations
pagination_load   [  24% ] 001/100 VUs  0m14.4s/1m0s  100.00 iters/s

running (0m27.0s), 001/100 VUs, 1543 complete and 0 interrupted iterations
pagination_load   [  26% ] 001/100 VUs  0m15.4s/1m0s  100.00 iters/s

running (0m28.0s), 001/100 VUs, 1643 complete and 0 interrupted iterations
pagination_load   [  27% ] 001/100 VUs  0m16.4s/1m0s  100.00 iters/s

running (0m29.0s), 001/100 VUs, 1743 complete and 0 interrupted iterations
pagination_load   [  29% ] 001/100 VUs  0m17.4s/1m0s  100.00 iters/s

running (0m30.0s), 001/100 VUs, 1843 complete and 0 interrupted iterations
pagination_load   [  31% ] 001/100 VUs  0m18.4s/1m0s  100.00 iters/s

running (0m31.0s), 001/100 VUs, 1943 complete and 0 interrupted iterations
pagination_load   [  32% ] 001/100 VUs  0m19.4s/1m0s  100.00 iters/s

running (0m32.0s), 001/100 VUs, 2043 complete and 0 interrupted iterations
pagination_load   [  34% ] 001/100 VUs  0m20.4s/1m0s  100.00 iters/s

running (0m33.0s), 001/100 VUs, 2143 complete and 0 interrupted iterations
pagination_load   [  36% ] 001/100 VUs  0m21.4s/1m0s  100.00 iters/s

running (0m34.0s), 001/100 VUs, 2243 complete and 0 interrupted iterations
pagination_load   [  37% ] 001/100 VUs  0m22.4s/1m0s  100.00 iters/s

running (0m35.0s), 001/100 VUs, 2343 complete and 0 interrupted iterations
pagination_load   [  39% ] 001/100 VUs  0m23.4s/1m0s  100.00 iters/s

running (0m36.0s), 001/100 VUs, 2443 complete and 0 interrupted iterations
pagination_load   [  41% ] 001/100 VUs  0m24.4s/1m0s  100.00 iters/s

running (0m37.0s), 001/100 VUs, 2543 complete and 0 interrupted iterations
pagination_load   [  42% ] 001/100 VUs  0m25.4s/1m0s  100.00 iters/s

running (0m38.0s), 001/100 VUs, 2643 complete and 0 interrupted iterations
pagination_load   [  44% ] 001/100 VUs  0m26.4s/1m0s  100.00 iters/s

running (0m39.0s), 001/100 VUs, 2743 complete and 0 interrupted iterations
pagination_load   [  46% ] 001/100 VUs  0m27.4s/1m0s  100.00 iters/s

running (0m40.0s), 001/100 VUs, 2843 complete and 0 interrupted iterations
pagination_load   [  47% ] 001/100 VUs  0m28.4s/1m0s  100.00 iters/s

running (0m41.0s), 001/100 VUs, 2943 complete and 0 interrupted iterations
pagination_load   [  49% ] 001/100 VUs  0m29.4s/1m0s  100.00 iters/s

running (0m42.0s), 001/100 VUs, 3043 complete and 0 interrupted iterations
pagination_load   [  51% ] 001/100 VUs  0m30.4s/1m0s  100.00 iters/s

running (0m43.0s), 001/100 VUs, 3143 complete and 0 interrupted iterations
pagination_load   [  52% ] 001/100 VUs  0m31.4s/1m0s  100.00 iters/s

running (0m44.0s), 001/100 VUs, 3243 complete and 0 interrupted iterations
pagination_load   [  54% ] 001/100 VUs  0m32.4s/1m0s  100.00 iters/s

running (0m45.0s), 001/100 VUs, 3343 complete and 0 interrupted iterations
pagination_load   [  56% ] 001/100 VUs  0m33.4s/1m0s  100.00 iters/s

running (0m46.0s), 001/100 VUs, 3443 complete and 0 interrupted iterations
pagination_load   [  57% ] 001/100 VUs  0m34.4s/1m0s  100.00 iters/s

running (0m47.0s), 001/100 VUs, 3543 complete and 0 interrupted iterations
pagination_load   [  59% ] 001/100 VUs  0m35.4s/1m0s  100.00 iters/s

running (0m48.0s), 001/100 VUs, 3643 complete and 0 interrupted iterations
pagination_load   [  61% ] 001/100 VUs  0m36.4s/1m0s  100.00 iters/s

running (0m49.0s), 001/100 VUs, 3743 complete and 0 interrupted iterations
pagination_load   [  62% ] 001/100 VUs  0m37.4s/1m0s  100.00 iters/s

running (0m50.0s), 001/100 VUs, 3843 complete and 0 interrupted iterations
pagination_load   [  64% ] 001/100 VUs  0m38.4s/1m0s  100.00 iters/s

running (0m51.0s), 001/100 VUs, 3943 complete and 0 interrupted iterations
pagination_load   [  66% ] 001/100 VUs  0m39.4s/1m0s  100.00 iters/s

running (0m52.0s), 001/100 VUs, 4043 complete and 0 interrupted iterations
pagination_load   [  67% ] 001/100 VUs  0m40.4s/1m0s  100.00 iters/s

running (0m53.0s), 001/100 VUs, 4143 complete and 0 interrupted iterations
pagination_load   [  69% ] 001/100 VUs  0m41.4s/1m0s  100.00 iters/s

running (0m54.0s), 001/100 VUs, 4243 complete and 0 interrupted iterations
pagination_load   [  71% ] 001/100 VUs  0m42.4s/1m0s  100.00 iters/s

running (0m55.0s), 001/100 VUs, 4343 complete and 0 interrupted iterations
pagination_load   [  72% ] 001/100 VUs  0m43.4s/1m0s  100.00 iters/s

running (0m56.0s), 001/100 VUs, 4443 complete and 0 interrupted iterations
pagination_load   [  74% ] 001/100 VUs  0m44.4s/1m0s  100.00 iters/s

running (0m57.0s), 001/100 VUs, 4543 complete and 0 interrupted iterations
pagination_load   [  76% ] 001/100 VUs  0m45.4s/1m0s  100.00 iters/s

running (0m58.0s), 001/100 VUs, 4643 complete and 0 interrupted iterations
pagination_load   [  77% ] 001/100 VUs  0m46.4s/1m0s  100.00 iters/s

running (0m59.0s), 001/100 VUs, 4743 complete and 0 interrupted iterations
pagination_load   [  79% ] 001/100 VUs  0m47.4s/1m0s  100.00 iters/s

running (1m00.0s), 001/100 VUs, 4843 complete and 0 interrupted iterations
pagination_load   [  81% ] 001/100 VUs  0m48.4s/1m0s  100.00 iters/s

running (1m01.0s), 001/100 VUs, 4943 complete and 0 interrupted iterations
pagination_load   [  82% ] 001/100 VUs  0m49.4s/1m0s  100.00 iters/s

running (1m02.0s), 001/100 VUs, 5043 complete and 0 interrupted iterations
pagination_load   [  84% ] 001/100 VUs  0m50.4s/1m0s  100.00 iters/s

running (1m03.0s), 001/100 VUs, 5143 complete and 0 interrupted iterations
pagination_load   [  86% ] 001/100 VUs  0m51.4s/1m0s  100.00 iters/s

running (1m04.0s), 001/100 VUs, 5243 complete and 0 interrupted iterations
pagination_load   [  87% ] 001/100 VUs  0m52.4s/1m0s  100.00 iters/s

running (1m05.0s), 001/100 VUs, 5343 complete and 0 interrupted iterations
pagination_load   [  89% ] 001/100 VUs  0m53.4s/1m0s  100.00 iters/s

running (1m06.0s), 001/100 VUs, 5443 complete and 0 interrupted iterations
pagination_load   [  91% ] 001/100 VUs  0m54.4s/1m0s  100.00 iters/s

running (1m07.0s), 001/100 VUs, 5543 complete and 0 interrupted iterations
pagination_load   [  92% ] 001/100 VUs  0m55.4s/1m0s  100.00 iters/s

running (1m08.0s), 001/100 VUs, 5643 complete and 0 interrupted iterations
pagination_load   [  94% ] 001/100 VUs  0m56.4s/1m0s  100.00 iters/s

running (1m09.0s), 001/100 VUs, 5743 complete and 0 interrupted iterations
pagination_load   [  96% ] 001/100 VUs  0m57.4s/1m0s  100.00 iters/s

running (1m10.0s), 001/100 VUs, 5843 complete and 0 interrupted iterations
pagination_load   [  97% ] 001/100 VUs  0m58.4s/1m0s  100.00 iters/s

running (1m11.0s), 001/100 VUs, 5943 complete and 0 interrupted iterations
pagination_load   [  99% ] 001/100 VUs  0m59.4s/1m0s  100.00 iters/s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<500' p(95)=5.89ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 8501    118.816545/s
    checks_succeeded...: 100.00% 8501 out of 8501
    checks_failed......: 0.00%   0 out of 8501

    ✓ setup status is 200
    ✓ status is 200

    HTTP
    http_req_duration..............: avg=4.55ms min=3.68ms med=4.37ms max=47.45ms p(90)=4.9ms  p(95)=5.89ms
      { expected_response:true }...: avg=4.55ms min=3.68ms med=4.37ms max=47.45ms p(90)=4.9ms  p(95)=5.89ms
    http_req_failed................: 0.00%  0 out of 8501
    http_reqs......................: 8501   118.816545/s

    EXECUTION
    iteration_duration.............: avg=4.73ms min=3.84ms med=4.52ms max=47.52ms p(90)=5.13ms p(95)=6.07ms
    iterations.....................: 6001   83.874613/s
    vus............................: 1      min=0         max=1  
    vus_max........................: 100    min=100       max=100

    NETWORK
    data_received..................: 34 MB  473 kB/s
    data_sent......................: 918 kB 13 kB/s



running (1m11.5s), 000/100 VUs, 6001 complete and 0 interrupted iterations
pagination_load ✓ [ 100% ] 000/100 VUs  1m0s  100.00 iters/s